Optimize docukmentation
